app/Http/Controllers/EventController.php

select * from `events` where `events`.`id` = '6' limit 1
---
    public function show($id)
    {
        $event = Event::with('registrations')->findOrFail($id);

select * from `documentations` where `documentations`.`event_id` in (6)
---
    public function showDocumentation($id)
    {
        $event = Event::with('documentations')->findOrFail($id);