app/Http/Controllers/HomeController.php

    public function index()
    {
        // get upcoming events (maks 3)
        $upcomingEvents = Event::active()
            ->upcoming()
            ->limit(3)
            ->get();

        // get featured artworks for home gallery (maks 4 spy bisa square)
        $featuredArtworks = Artwork::with('category')
            ->orderBy('created_date', 'desc')
            ->limit(4)
            ->get();
---
select * from `artworks` order by `created_date` desc limit 4