app/Http/Controllers/Admin/ArtworkController.php

    public function index(Request $request)
    {
        $search = $request->input('search');
        $categoryFilter = $request->input('category');

        // Query Artworks with their category
        $query = Artwork::with('category')
            ->when($search, function ($q, $search) {
                return $q->where('title', 'like', "%{$search}%")
                    ->orWhere('artist_name', 'like', "%{$search}%")
                    ->orWhere('description', 'like', "%{$search}%");
            })
            ->when($categoryFilter, function ($q, $categoryFilter) {
                return $q->where('category_id', $categoryFilter);
            })
            ->latest();

        // Fetch paginated artworks (10 per page for admin)
        $artworks = $query->paginate(10);

        // Fetch all categories for the filter dropdown
        $categories = ArtworkCategory::all();
---
select * from `artworks` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `artworks`
select * from `artwork_categories`