app/Http/Controllers/Admin/DashboardController.php

select count(*) as aggregate from `artworks`
select count(*) as aggregate from `events`
select count(*) as aggregate from `events` where `start_date` >= '2025-11-11 13:13:03'
select count(*) as aggregate from `documentations`
select count(*) as aggregate from `users`
select count(*) as aggregate from `artworks` where month(`created_date`) = '11' and year(`created_date`) = 2025
select count(*) as aggregate from `artworks` where month(`created_date`) = '10' and year(`created_date`) = 2025
select * from `events` order by `created_at` desc limit 5
select * from `artworks` order by `created_date` desc limit 5
---
    public function index()
    {
        // Fetch statistics
        $totalArtworks = Artwork::count();
        $totalEvents = Event::count();
        $upcomingEvents = Event::where('start_date', '>=', now())->count();
        $totalDocumentation = Documentation::count();
        $userRegistrations = User::count();

        // Calculate monthly growth (artworks added this month vs last month)
        $currentMonthArtworks = Artwork::whereMonth('created_date', now()->month)
            ->whereYear('created_date', now()->year)
            ->count();
        $lastMonthArtworks = Artwork::whereMonth('created_date', now()->subMonth()->month)
            ->whereYear('created_date', now()->subMonth()->year)
            ->count();

        if ($lastMonthArtworks > 0) {
            $monthlyGrowth = round((($currentMonthArtworks - $lastMonthArtworks) / $lastMonthArtworks) * 100);
        } else {
            $monthlyGrowth = $currentMonthArtworks > 0 ? 100 : 0;
        }

        // Search for events
        $eventSearch = request('event_search');
        $recentEvents = Event::query()
            ->when($eventSearch, function ($query, $search) {
                return $query->where('title', 'like', "%{$search}%")
                    ->orWhere('description', 'like', "%{$search}%")
                    ->orWhere('location', 'like', "%{$search}%");
            })
            ->latest('created_at')
            ->take(5)
            ->get();

        // Search for artworks
        $artworkSearch = request('artwork_search');
        $recentArtworks = Artwork::query()
            ->with('category')
            ->when($artworkSearch, function ($query, $search) {
                return $query->where('title', 'like', "%{$search}%")
                    ->orWhere('artist_name', 'like', "%{$search}%")
                    ->orWhere('description', 'like', "%{$search}%");
            })
            ->latest('created_date')
            ->take(5)
            ->get();