app/Http/Controllers/Admin/DocumentationController.php

select * from `documentations` where `documentations`.`event_id` = 16 and `documentations`.`event_id` is not null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `documentations` where `documentations`.`event_id` = 16 and `documentations`.`event_id` is not null
---
    public function index(Event $event)
    {
        // Fetch documentation specific to the current event, ordered by date
        $documentations = $event->documentations()->orderBy('created_at', 'desc')->paginate(10);

select * from `events`
---
    public function store(Request $request, Event $event)
    {
        // 1. Validation (Photos only: max 10MB)
        $request->validate([
            'title' => 'required|string|max:255',
            'media_file' => 'required|file|mimes:jpeg,png,jpg|max:10240', // 10MB max for photo
            'caption' => 'nullable|string',
        ]);

        // 2. Handle file upload (saves to storage/app/public/documentation)
        $file = $request->file('media_file');
        $filePath = $file->store('documentation', 'public');

        // 3. Create Documentation record
        Documentation::create([
            'event_id' => $event->id, // Uses the Event provided by Route Model Binding
            'title' => $request->title,
            'file_path' => 'storage/' . $filePath, // Store the public path
            'file_type' => 'photo', // HARDCODED for photos only
            'caption' => $request->caption,
            'is_featured' => $request->has('is_featured'),
        ]);

        // 4. Redirect
        return redirect()->route('admin.events.documentation.index', $event->id)
                         ->with('success', 'Documentation added successfully!');