app/Http/Controllers/Admin/EventController.php

    public function index()
    {
        $search = request('search');

        $upcomingEvents = Event::query()
            ->when($search, function ($query, $search) {
                return $query->where('title', 'like', "%{$search}%")
                    ->orWhere('description', 'like', "%{$search}%")
                    ->orWhere('location', 'like', "%{$search}%");
            })
            ->where('start_date', '>=', now())
            ->orderBy('start_date', 'asc')
            ->paginate(10, ['*'], 'upcoming_page');

        $pastEvents = Event::query()
            ->when($search, function ($query, $search) {
                return $query->where('title', 'like', "%{$search}%")
                    ->orWhere('description', 'like', "%{$search}%")
                    ->orWhere('location', 'like', "%{$search}%");
            })
            ->where('start_date', '<', now())
            ->orderBy('start_date', 'desc')
            ->paginate(10, ['*'], 'past_page');
---
select * from `events` where `start_date` >= '2025-11-11 13:15:33' order by `start_date` asc limit 10 offset 0
select count(*) as aggregate from `events` where `start_date` >= '2025-11-11 13:15:33'
select * from `events` where `start_date` < '2025-11-11 13:15:33' order by `start_date` desc limit 10 offset 0
select count(*) as aggregate from `events` where `start_date` < '2025-11-11 13:15:33'

    public function store(Request $request)
    {

        $request->validate([
            'title' => 'required|string|max:255',
            'description' => 'required|string',
            'poster_image' => 'required|image|mimes:jpeg,png,jpg|max:20480', // Max 20MB
            'start_date' => 'required|date_format:Y-m-d\TH:i',
            'end_date' => 'nullable|date_format:Y-m-d\TH:i|after:start_date',
            'registration_deadline' => 'nullable|date|before:start_date',
            'price' => 'nullable|numeric|min:0',
            'location' => 'nullable|string|max:255',
        ]);

        $data = $request->except(['_token']);
        $data['poster_image'] = $request->file('poster_image');
        $data['is_active'] = $request->has('is_active');

        Event::create($data);
---
insert into `events` (`title`, `description`, `start_date`, `end_date`, `registration_deadline`, `price`, `max_participants`, `location`, `is_active`, `poster_image`, `updated_at`, `created_at`) values ('Event baru', 'event baru desc', '2025-11-05 20:14:00', '2025-11-08 20:15:00', null, '0', null, null, 1, 'events/posters/YQnoiJFIE90dXOoL7X6yVR51ewhZABo280R411AF.png', '2025-11-11 13:15:32', '2025-11-11 13:15:32')